<#import "macros/standart.ftl" as standart>
<#import "macros/navbar.ftl" as nav>

<@standart.standart>
    <@nav.navbar/>
<section class="container">
    <h1>Немного теории</h1>
    <div>Многие из нас сталкивались с понятием прокси-сервер, но не всегда понятно, что же это есть на самом деле.<b>
        Прокси-сервер</b> – удаленный компьютер, являющийся посредником между вами и конечным интернет-ресурсом. Задачей
        прокси-сервера является посредническая передача информации в обе стороны между сторонами. Но возможностей у
        прокси-сервера гораздо больше, чем кажется на первый взгляд.
    </div>
    <br>
    <div>Давайте рассмотрим их:
        <ul>
            <li>Увеличение скорости при работе с ресурсами</li>
            <li>Обход банов в различных играх, форумах и т.д.</li>
            <li>Анонимность работы в сети.</li>
        </ul>
    </div>
    <div>
        <b>Как можно увеличить скорость в интернете, используя
            прокси-сервер?</b><br>
        <span>Это наиболее часто задаваемый вопрос, который тревожит умы
		многих людей, когда они получают бан на игровых форумах, сайтах avito,
		irr, играх и т.д. Как же технически происходит бан на сайте? Компьютер
		включает ваш ip-адрес в черный список, который блокирует доступ к
		ресурсам компьютеру, с данным ip-адресом. Но так как прокси-сервер –
		это уже совершенно другой компьютер с другим адресом, соответственно,
		вы уже имеете доступ. Администратор закрыл доступ вконтакте,
		одноклассники(как например на Украине)? Не вопрос, прокси-сервер позволит вам обойти данные
		запреты, не попадая в статистику и не выдавая вас. Также, существует
		множество игр, в которых требуется создавать дополнительные аккаунты
		для получения каких-либо преимуществ. Это называется мультоводством и
		банится администрацией игр. Прокси-сервер поможет обойти вам данные
		запреты и не получить бан аккаунта и позволит спокойно играть и
      наслаждаться процессом. </span>
    </div>
    <br>
    <div>
        <b>Как обеспечить
            анонимность, работая в сети?</b>
        <br>
        <span>Посещение некоторых
		ресурсов может негативно сказаться на вашей репутации, опасно с точки
		зрения закона, да и просто вы не хотите позволять кому-то собирать
		информацию о ваших перемещения в сети посторонним людям. Использование
		прокси-сервера в данном случае также будет способствовать вашей
		«невидимости» в сети, ведь реально будет отображаться не ваш адрес, а
		адрес прокси-сервера. И теперь вы можете не бояться фразы в сети «Я
		тебя по айпишнику вычислю».
	</span>
    </div>
    <br>
    <div>
        <b>Какие плюсы для бизнеса?</b>
        <br>
        <span>Благодаря тому, что к прокси серверу могут подключаться несколько пользователей, все они выходят в интернет под одним ip.
            Администратор сервера также может ограничить доступ к нежелательным адресам, убрать рекламу на сайтах, тем самым
            создав выход в интернет для пользователей без ненужного, отвлекающего контента (к примеру сафу использует proxy сервер)
	</span>
    </div>
</section>
</@standart.standart>